TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_ssu.h
//###########################################################################
//
// FILE:    hw_ssu.h
//
// TITLE:   Definitions for the SSU registers.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_SSU_H
#define HW_SSU_H

//*************************************************************************************************
//
// The following are defines for the SSU register offsets
//
//*************************************************************************************************
#define SSU_O_REVISION                   0x0U     // Module Revision Register
#define SSU_O_UPP_REVISION               0x4U     // User Protection Policy Revision
#define SSU_O_MODE                       0x8U     // Safety and Security Operational Mode
#define SSU_O_LINK2_AP_OVERRIDE          0xCU     // LINK2 Access Protection Override Register
#define SSU_O_BOOTMODE_STAT              0x2CU    // User Boot Mode Status Register
#define SSU_O_EMU_BOOTPIN_CONFIG         0x30U    // User Emulation Boot Pin Configuration
#define SSU_O_EMU_BOOT_DIAG              0x34U    // User Emulation Boot Options
#define SSU_O_EMU_BOOT_CLKCFG            0x38U    // User Emulation Boot Clock Configuration
                                                  // Register
#define SSU_O_EMU_BOOTEN                 0x3CU    // User Emulation Boot Enable
#define SSU_O_RAMOPEN_LOCK               0x40U    // RAMOPEN Feature Lock Register
#define SSU_O_RAMOPEN_COMMIT             0x44U    // RAMOPEN Feature Commit Register
#define SSU_O_CPUID                      0x4CU    // CPUID Register
#define SSU_O_BANKMAP                    0x50U    // Valid Banks
#define SSU_O_BANKMAP_LOCK               0x54U    // Bank Map Lock Register
#define SSU_O_BANKMAP_COMMIT             0x58U    // Bank Map Commit Register
#define SSU_O_BANKMODE                   0x5CU    // Bank Mode Configuration Register
#define SSU_O_BANKMODE_LOCK              0x60U    // Bank Mode Lock Register
#define SSU_O_BANKMODE_COMMIT            0x64U    // Bank Mode Commit Register
#define SSU_O_SECCFG_UPDATE_CFG          0x68U    // SECCFG Flash Update Configuration Register
#define SSU_O_PROG_BANKMODE              0x70U    // Programming BANKMODE Register
#define SSU_O_SECVALID                   0x74U    // Valid SECCFG Sector
#define SSU_O_SECVALID_LOCK              0x78U    // Valid SECCFG Sector Lock Register
#define SSU_O_SECVALID_COMMIT            0x7CU    // Valid SECCFG Sector Commit Register
#define SSU_O_ZONE1_CFG                  0x80U    // ZONE1 Configuration
#define SSU_O_ZONE2_CFG                  0x84U    // ZONE2 Configuration
#define SSU_O_ZONE3_CFG                  0x88U    // ZONE3 Configuration
#define SSU_O_DEBUG_CFG                  0x90U    // Debug Configuration
#define SSU_O_DEBUG_CFG_LOCK             0x94U    // Debug Configuration Lock Register
#define SSU_O_DEBUG_CFG_COMMIT           0x98U    // Debug Configuration Commit Register
#define SSU_O_DEBUG_STAT                 0xA0U    // Debug Status Register
#define SSU_O_C29DBGEN                   0xA4U    // C29 Debug Enable Register
#define SSU_O_ZONE_DBGEN                 0xA8U    // ZONE Debug Enable Register
#define SSU_O_BEPROT_BANK                0x200U   // Bank Erase Protection Bank Register
#define SSU_O_BEPROT_STAT                0x204U   // Bank Erase Status Register
#define SSU_O_BEPROTA                    0x208U   // Bank Erase Protection Register A
#define SSU_O_BEPROTB                    0x20CU   // Bank Erase Protection Register B
#define SSU_O_FLSEMSTAT                  0x220U   // Flash Controller Semaphore Status Register
#define SSU_O_FLSEMREQ                   0x224U   // Flash Controller Semaphore Request Register
#define SSU_O_FLSEMCLR                   0x228U   // Flash Controller Semaphore Clear Register
#define SSU_O_WEPROT_CODE_BANKS          0x230U   // Global Code Banks Write Erase
#define SSU_O_WEPROT_CODE_BANKS_LOCK     0x234U   // Global Code Banks Write Erase Lock
#define SSU_O_WEPROT_CODE_BANKS_COMMIT   0x238U   // Global Code Banks Write Erase Commit
#define SSU_O_WEPROT_DATA_BANKS          0x240U   // Global Data Banks Write Erase
#define SSU_O_WEPROT_DATA_BANKS_LOCK     0x244U   // Global Data Banks Write Erase Lock
#define SSU_O_WEPROT_DATA_BANKS_COMMIT   0x248U   // Global Data Banks Write Erase Commit
#define SSU_O_WEPROT_FLC1_B0_A           0x300U   // Flash Controller 1 B0 Write Erase Protection A
#define SSU_O_WEPROT_FLC1_B0_B           0x304U   // Flash Controller 1 B0 Write Erase Protection B
#define SSU_O_WEPROT_FLC1_B0_LOCK        0x310U   // Flash Controller 1 B0 WEPROTA Lock
#define SSU_O_WEPROT_FLC1_B0_COMMIT      0x314U   // Flash Controller 1 B0 WEPROTA Commit
#define SSU_O_WEPROT_FLC1_B2_A           0x340U   // Flash Controller 1 B2 Write Erase Protection A
#define SSU_O_WEPROT_FLC1_B2_B           0x344U   // Flash Controller 1 B2 Write Erase Protection B
#define SSU_O_WEPROT_FLC1_B2_LOCK        0x350U   // Flash Controller 1 B2 WEPROTA Lock
#define SSU_O_WEPROT_FLC1_B2_COMMIT      0x354U   // Flash Controller 1 B2 WEPROTA Commit
#define SSU_O_WEPROT_FLC2_B0_A           0x3A0U   // Flash Controller 2 B0 Write Erase Protection A
#define SSU_O_WEPROT_FLC2_B0_B           0x3A4U   // Flash Controller 2 B0 Write Erase Protection B
#define SSU_O_WEPROT_FLC2_B0_LOCK        0x3B0U   // Flash Controller 2 B0 WEPROTA Lock
#define SSU_O_WEPROT_FLC2_B0_COMMIT      0x3B4U   // Flash Controller 2 B0 WEPROTA Commit
#define SSU_O_WEPROT_FLC2_B2_A           0x3E0U   // Flash Controller 2 B2 Write Erase Protection A
#define SSU_O_WEPROT_FLC2_B2_B           0x3E4U   // Flash Controller 2 B2 Write Erase Protection B
#define SSU_O_WEPROT_FLC2_B2_LOCK        0x3F0U   // Flash Controller 2 B2 WEPROTA Lock
#define SSU_O_WEPROT_FLC2_B2_COMMIT      0x3F4U   // Flash Controller 2 B2 WEPROTA Commit

#define SSU_O_RST_VECT              0x0U    // CPU Reset Vector
#define SSU_O_RST_LINK              0x4U    // CPU Reset LINK
#define SSU_O_CPU_RST_CTRL          0x8U    // CPU Reset Control
#define SSU_O_DEF_NMI_VECT          0x10U   // Default CPU NMI Vector
#define SSU_O_DEF_NMI_LINK          0x14U   // Default CPU NMI LINK
#define SSU_O_EMU_BOOTDEF_LOW       0x28U   // User Emulation Boot Definition Low Register
#define SSU_O_EMU_BOOTDEF_HIGH      0x2CU   // User Emulation Boot Definition High Register
#define SSU_O_LINK3_CFG             0x3CU   // LINK3 Configuration
#define SSU_O_LINK4_CFG             0x40U   // LINK4 Configuration
#define SSU_O_LINK5_CFG             0x44U   // LINK5 Configuration
#define SSU_O_LINK6_CFG             0x48U   // LINK6 Configuration
#define SSU_O_LINK7_CFG             0x4CU   // LINK7 Configuration
#define SSU_O_LINK8_CFG             0x50U   // LINK8 Configuration
#define SSU_O_LINK9_CFG             0x54U   // LINK9 Configuration
#define SSU_O_LINK10_CFG            0x58U   // LINK10 Configuration
#define SSU_O_LINK11_CFG            0x5CU   // LINK11 Configuration
#define SSU_O_LINK12_CFG            0x60U   // LINK12 Configuration
#define SSU_O_LINK13_CFG            0x64U   // LINK13 Configuration
#define SSU_O_LINK14_CFG            0x68U   // LINK14 Configuration
#define SSU_O_LINK15_CFG            0x6CU   // LINK15 Configuration
#define SSU_O_STACK3_CFG            0x7CU   // STACK3 Configuration
#define SSU_O_STACK4_CFG            0x80U   // STACK4 Configuration
#define SSU_O_STACK5_CFG            0x84U   // STACK5 Configuration
#define SSU_O_STACK6_CFG            0x88U   // STACK6 Configuration
#define SSU_O_STACK7_CFG            0x8CU   // STACK7 Configuration
#define SSU_O_RAMOPENSTAT           0x90U   // RAMOPEN Feature Status Register
#define SSU_O_RAMOPENFRC            0x94U   // RAMOPEN Feature Force Register
#define SSU_O_RAMOPENCLR            0x98U   // RAMOPEN Feature Clear Register
#define SSU_O_DECODER_ADDR_IN       0xA0U   // SW ZONE Decoder Address Input
#define SSU_O_DECODER_OUT           0xA4U   // SW ZONE Decoder Output
#define SSU_O_EMU_DECODER_ADDR_IN   0xA8U   // SW ZONE Decoder Address Input
#define SSU_O_EMU_DECODER_OUT       0xACU   // SW ZONE Decoder Output

