TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_ssu.h
#define SSU_O_AP_CFG(i)      (0x0U + ((i) * 32U))    // (0 <= i < 64) Access Protection 
                                                        // Configuration
#define SSU_O_AP_START(i)    (0x4U + ((i) * 32U))    // (0 <= i < 64) Access Protection  Start
                                                        // Address
#define SSU_O_AP_END(i)      (0x8U + ((i) * 32U))    // (0 <= i < 64) Access Protection  End
                                                        // Address
#define SSU_O_AP_LOCK(i)     (0xCU + ((i) * 32U))    // (0 <= i < 64) Access Protection 
                                                        // Temporary Lock
#define SSU_O_AP_COMMIT(i)   (0x10U + ((i) * 32U))   // (0 <= i < 64) Access Protection 
                                                        // Permanent Commit
#define SSU_O_AP_ACCESS(i)   (0x14U + ((i) * 32U))   // (0 <= i < 64) Access Protection  R/W
                                                        // Access Permissions


//*************************************************************************************************
//
// The following are defines for the bit fields in the REVISION register
//
//*************************************************************************************************
#define SSU_REVISION_MINREV_S   0U
#define SSU_REVISION_MINREV_M   0xFFU     // Minor Revision Number
#define SSU_REVISION_MAJREV_S   8U
#define SSU_REVISION_MAJREV_M   0xFF00U   // Major Revision Number

//*************************************************************************************************
//
// The following are defines for the bit fields in the UPP_REVISION register
//
//*************************************************************************************************
#define SSU_UPP_REVISION_REV_S   0U
#define SSU_UPP_REVISION_REV_M   0xFFFFU   // User Protection Policy Revision

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSUMODE register
//
//*************************************************************************************************
#define SSU_MODE_OPMODE_S   0U
#define SSU_MODE_OPMODE_M   0x3FU   // SSU Operational Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the LINK2_AP_OVERRIDE register
//
//*************************************************************************************************
#define SSU_LINK2_AP_OVERRIDE_CPU1   0x1U   // CPU1 LINK2 Access Protection Override Bit
#define SSU_LINK2_AP_OVERRIDE_CPU2   0x2U   // CPU2 LINK2 Access Protection Override Bit
#define SSU_LINK2_AP_OVERRIDE_CPU3   0x4U   // CPU3 LINK2 Access Protection Override Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the BOOTMODE_STAT register
//
//*************************************************************************************************
#define SSU_BOOTMODE_STAT_PIN_STAT_S   0U
#define SSU_BOOTMODE_STAT_PIN_STAT_M   0x7U   // Boot Mode Pin Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the EMU_BOOTPIN_CONFIG register
//
//*************************************************************************************************
#define SSU_EMU_BOOTPIN_CONFIG_BMSP0_S   0U
#define SSU_EMU_BOOTPIN_CONFIG_BMSP0_M   0xFFU         // Boot Mode Select Pin 0
#define SSU_EMU_BOOTPIN_CONFIG_BMSP1_S   8U
#define SSU_EMU_BOOTPIN_CONFIG_BMSP1_M   0xFF00U       // Boot Mode Select Pin 1
#define SSU_EMU_BOOTPIN_CONFIG_BMSP2_S   16U
#define SSU_EMU_BOOTPIN_CONFIG_BMSP2_M   0xFF0000U     // Boot Mode Select Pin 2
#define SSU_EMU_BOOTPIN_CONFIG_KEY_S     24U
#define SSU_EMU_BOOTPIN_CONFIG_KEY_M     0xFF000000U   // Register Valid Key

//*************************************************************************************************
//
// The following are defines for the bit fields in the EMU_BOOT_DIAG register
//
//*************************************************************************************************
#define SSU_EMU_BOOT_DIAG_LPOST_EN_S      0U
#define SSU_EMU_BOOT_DIAG_LPOST_EN_M      0x3U    // LPOST Enable
#define SSU_EMU_BOOT_DIAG_LPOST_COVER_S   2U
#define SSU_EMU_BOOT_DIAG_LPOST_COVER_M   0xCU    // LPOST Coverage
#define SSU_EMU_BOOT_DIAG_MPOST_EN_S      4U
#define SSU_EMU_BOOT_DIAG_MPOST_EN_M      0x30U   // MPOST Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the EMU_BOOT_CLKCFG register
//
//*************************************************************************************************
#define SSU_EMU_BOOT_CLKCFG_IMULT_S    0U
#define SSU_EMU_BOOT_CLKCFG_IMULT_M    0xFFU         // Secure Boot PLL IMULT
#define SSU_EMU_BOOT_CLKCFG_ODIV_S     8U
#define SSU_EMU_BOOT_CLKCFG_ODIV_M     0x1F00U       // Secure Boot PLL ODIV
#define SSU_EMU_BOOT_CLKCFG_REFDIV_S   16U
#define SSU_EMU_BOOT_CLKCFG_REFDIV_M   0x1F0000U     // Secure Boot PLL REFDIV
#define SSU_EMU_BOOT_CLKCFG_PLLEN_S    28U
#define SSU_EMU_BOOT_CLKCFG_PLLEN_M    0xF0000000U   // Secure Boot PLL Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the EMU_BOOTEN register
//
//*************************************************************************************************
#define SSU_EMU_BOOTEN_ENABLE   0x1U   // Emulation Boot Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the RAMOPEN_LOCK register
//
//*************************************************************************************************
#define SSU_RAMOPEN_LOCK_LOCK_S   0U
#define SSU_RAMOPEN_LOCK_LOCK_M   0xFFU   // RAMOPEN Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the RAMOPEN_COMMIT register
//
//*************************************************************************************************
#define SSU_RAMOPEN_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUID register
//
//*************************************************************************************************
#define SSU_CPUID_CPUID_S   0U
#define SSU_CPUID_CPUID_M   0x7U    // CPUID Value
#define SSU_CPUID_DBGREAD   0x10U   // Debug Read Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the BANKMAP register
//
//*************************************************************************************************
#define SSU_BANKMAP_CPU1SWAP_S   0U
#define SSU_BANKMAP_CPU1SWAP_M   0xFFU     // CPU1 Bank Swap
#define SSU_BANKMAP_CPU3SWAP_S   8U
#define SSU_BANKMAP_CPU3SWAP_M   0xFF00U   // CPU3 Bank Swap

//*************************************************************************************************
//
// The following are defines for the bit fields in the BANKMAP_LOCK register
//
//*************************************************************************************************
#define SSU_BANKMAP_LOCK_LOCK1   0x1U   // CPU1 Bank Swap Lock
#define SSU_BANKMAP_LOCK_LOCK2   0x2U   // CPU3 Bank Swap Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the BANKMAP_COMMIT register
//
//*************************************************************************************************
#define SSU_BANKMAP_COMMIT_COMMIT1   0x1U   // CPU1 Bank Swap Commit
#define SSU_BANKMAP_COMMIT_COMMIT2   0x2U   // CPU3 Bank Swap Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the BANKMODE register
//
//*************************************************************************************************
#define SSU_BANKMODE_MODE_S   0U
#define SSU_BANKMODE_MODE_M   0xFU   // Device Flash Configuration Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the BANKMODE_LOCK register
//
//*************************************************************************************************
#define SSU_BANKMODE_LOCK_LOCK   0x1U   // Bank Mode Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the BANKMODE_COMMIT register
//
//*************************************************************************************************
#define SSU_BANKMODE_COMMIT_COMMIT   0x1U   // Bank Mode Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SECCFG_UPDATE_CFG register
//
//*************************************************************************************************
#define SSU_SECCFG_UPDATE_CFG_LINK_OWNER_S   0U
#define SSU_SECCFG_UPDATE_CFG_LINK_OWNER_M   0xFU      // SECCFG Update Owner LINK
#define SSU_SECCFG_UPDATE_CFG_CPU_OWNER_S    8U
#define SSU_SECCFG_UPDATE_CFG_CPU_OWNER_M    0x700U    // SECCFG Update Owner CPU
#define SSU_SECCFG_UPDATE_CFG_UPDATE_EN_S    12U
#define SSU_SECCFG_UPDATE_CFG_UPDATE_EN_M    0xF000U   // SECCFG Update Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the PROG_BANKMODE register
//
//*************************************************************************************************
#define SSU_PROG_BANKMODE_MODE_S   0U
#define SSU_PROG_BANKMODE_MODE_M   0x3U   // Device Flash Configuration Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the SECVALID register
//
//*************************************************************************************************
#define SSU_SECVALID_CPU1_S   0U
#define SSU_SECVALID_CPU1_M   0xFFU       // Valid CPU1/CPU2 SECCFG Sector
#define SSU_SECVALID_CPU3_S   16U
#define SSU_SECVALID_CPU3_M   0xFF0000U   // Valid CPU3 SECCFG Sector

//*************************************************************************************************
//
// The following are defines for the bit fields in the SECVALID_LOCK register
//
//*************************************************************************************************
#define SSU_SECVALID_LOCK_LOCK   0x1U   // SECVALID LOCK

//*************************************************************************************************
//
// The following are defines for the bit fields in the SECVALID_COMMIT register
//
//*************************************************************************************************
#define SSU_SECVALID_COMMIT_COMMIT   0x1U   // Security Sectors Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ZONE1_CFG register
//
//*************************************************************************************************
#define SSU_ZONE1_CFG_FWU_LINK_S    0U
#define SSU_ZONE1_CFG_FWU_LINK_M    0xFU      // Firmware Update Owner LINK
#define SSU_ZONE1_CFG_FWU_CPU_S     8U
#define SSU_ZONE1_CFG_FWU_CPU_M     0x700U    // Firmware Update Owner CPU
#define SSU_ZONE1_CFG_UPDATE_EN_S   12U
#define SSU_ZONE1_CFG_UPDATE_EN_M   0xF000U   // ZONE1 Update Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ZONE2_CFG register
//
//*************************************************************************************************
#define SSU_ZONE2_CFG_FWU_LINK_S    0U
#define SSU_ZONE2_CFG_FWU_LINK_M    0xFU      // Firmware Update Owner LINK
#define SSU_ZONE2_CFG_FWU_CPU_S     8U
#define SSU_ZONE2_CFG_FWU_CPU_M     0x700U    // Firmware Update Owner CPU
#define SSU_ZONE2_CFG_UPDATE_EN_S   12U
#define SSU_ZONE2_CFG_UPDATE_EN_M   0xF000U   // ZONE2 Update Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ZONE3_CFG register
//
//*************************************************************************************************
#define SSU_ZONE3_CFG_FWU_LINK_S    0U
#define SSU_ZONE3_CFG_FWU_LINK_M    0xFU      // Firmware Update Owner LINK
#define SSU_ZONE3_CFG_FWU_CPU_S     8U
#define SSU_ZONE3_CFG_FWU_CPU_M     0x700U    // Firmware Update Owner CPU
#define SSU_ZONE3_CFG_UPDATE_EN_S   12U
#define SSU_ZONE3_CFG_UPDATE_EN_M   0xF000U   // ZONE3 Update Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEBUG_CFG register
//
//*************************************************************************************************
#define SSU_DEBUG_CFG_C29DBGEN_CFG_S   0U
#define SSU_DEBUG_CFG_C29DBGEN_CFG_M   0x7U      // C29DBGEN Enable Configuration
#define SSU_DEBUG_CFG_ZONE1_S          4U
#define SSU_DEBUG_CFG_ZONE1_M          0x70U     // ZONE1 Debug Enable Configuration
#define SSU_DEBUG_CFG_ZONE2_S          8U
#define SSU_DEBUG_CFG_ZONE2_M          0x700U    // ZONE2 Debug Enable Configuration
#define SSU_DEBUG_CFG_ZONE3_S          12U
#define SSU_DEBUG_CFG_ZONE3_M          0x7000U   // ZONE3 Debug Enable Configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEBUG_CFG_LOCK register
//
//*************************************************************************************************
#define SSU_DEBUG_CFG_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEBUG_CFG_COMMIT register
//
//*************************************************************************************************
#define SSU_DEBUG_CFG_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEBUG_STAT register
//
//*************************************************************************************************
#define SSU_DEBUG_STAT_ZONE1_S   2U
#define SSU_DEBUG_STAT_ZONE1_M   0xCU          // ZONE1 Debug State
#define SSU_DEBUG_STAT_ZONE2_S   4U
#define SSU_DEBUG_STAT_ZONE2_M   0x30U         // ZONE2 Debug State
#define SSU_DEBUG_STAT_ZONE3_S   6U
#define SSU_DEBUG_STAT_ZONE3_M   0xC0U         // ZONE3 Debug State
#define SSU_DEBUG_STAT_C29DBGS   0x80000000U   // C29 Debug Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the C29DBGEN register
//
//*************************************************************************************************
#define SSU_C29DBGEN_ENA_S   0U
#define SSU_C29DBGEN_ENA_M   0xFU   // C29 Debug Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ZONE_DBGEN register
//
//*************************************************************************************************
#define SSU_ZONE_DBGEN_ZONE1_S   0U
#define SSU_ZONE_DBGEN_ZONE1_M   0x3FU       // ZONE1 Debug Enable
#define SSU_ZONE_DBGEN_ZONE2_S   8U
#define SSU_ZONE_DBGEN_ZONE2_M   0x3F00U     // ZONE2 Debug Enable
#define SSU_ZONE_DBGEN_ZONE3_S   16U
#define SSU_ZONE_DBGEN_ZONE3_M   0x3F0000U   // ZONE3 Debug Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the BEPROT_BANK register
//
//*************************************************************************************************
#define SSU_BEPROT_BANK_BANKID_S   0U
#define SSU_BEPROT_BANK_BANKID_M   0x7U    // Bank Erase Bank
#define SSU_BEPROT_BANK_FLCID_S    3U
#define SSU_BEPROT_BANK_FLCID_M    0x18U   // Bank Erase Bank

//*************************************************************************************************
//
// The following are defines for the bit fields in the BEPROT_STAT register
//
//*************************************************************************************************
#define SSU_BEPROT_STAT_READY    0x1U   // Bank Erase State Machine Ready
#define SSU_BEPROT_STAT_ACTIVE   0x2U   // Bank Erase State Machine Initializing

//*************************************************************************************************
//
// The following are defines for the bit fields in the BEPROTA register
//
//*************************************************************************************************
#define SSU_BEPROTA_SECT0    0x1U          // Sector 0 Bank Erase Protection
#define SSU_BEPROTA_SECT1    0x2U          // Sector 1 Bank Erase Protection
#define SSU_BEPROTA_SECT2    0x4U          // Sector 2 Bank Erase Protection
#define SSU_BEPROTA_SECT3    0x8U          // Sector 3 Bank Erase Protection
#define SSU_BEPROTA_SECT4    0x10U         // Sector 4 Bank Erase Protection
#define SSU_BEPROTA_SECT5    0x20U         // Sector 5 Bank Erase Protection
#define SSU_BEPROTA_SECT6    0x40U         // Sector 6 Bank Erase Protection
#define SSU_BEPROTA_SECT7    0x80U         // Sector 7 Bank Erase Protection
#define SSU_BEPROTA_SECT8    0x100U        // Sector 8 Bank Erase Protection
#define SSU_BEPROTA_SECT9    0x200U        // Sector 9 Bank Erase Protection
#define SSU_BEPROTA_SECT10   0x400U        // Sector 10 Bank Erase Protection
#define SSU_BEPROTA_SECT11   0x800U        // Sector 11 Bank Erase Protection
#define SSU_BEPROTA_SECT12   0x1000U       // Sector 12 Bank Erase Protection
#define SSU_BEPROTA_SECT13   0x2000U       // Sector 13 Bank Erase Protection
#define SSU_BEPROTA_SECT14   0x4000U       // Sector 14 Bank Erase Protection
#define SSU_BEPROTA_SECT15   0x8000U       // Sector 15 Bank Erase Protection
#define SSU_BEPROTA_SECT16   0x10000U      // Sector 16 Bank Erase Protection
#define SSU_BEPROTA_SECT17   0x20000U      // Sector 17 Bank Erase Protection
#define SSU_BEPROTA_SECT18   0x40000U      // Sector 18 Bank Erase Protection
#define SSU_BEPROTA_SECT19   0x80000U      // Sector 19 Bank Erase Protection
#define SSU_BEPROTA_SECT20   0x100000U     // Sector 20 Bank Erase Protection
#define SSU_BEPROTA_SECT21   0x200000U     // Sector 21 Bank Erase Protection
#define SSU_BEPROTA_SECT22   0x400000U     // Sector 22 Bank Erase Protection
#define SSU_BEPROTA_SECT23   0x800000U     // Sector 23 Bank Erase Protection
#define SSU_BEPROTA_SECT24   0x1000000U    // Sector 24 Bank Erase Protection
#define SSU_BEPROTA_SECT25   0x2000000U    // Sector 25 Bank Erase Protection
#define SSU_BEPROTA_SECT26   0x4000000U    // Sector 26 Bank Erase Protection
#define SSU_BEPROTA_SECT27   0x8000000U    // Sector 27 Bank Erase Protection
#define SSU_BEPROTA_SECT28   0x10000000U   // Sector 28 Bank Erase Protection
#define SSU_BEPROTA_SECT29   0x20000000U   // Sector 29 Bank Erase Protection
#define SSU_BEPROTA_SECT30   0x40000000U   // Sector 30 Bank Erase Protection
#define SSU_BEPROTA_SECT31   0x80000000U   // Sector 31 Bank Erase Protection

//*************************************************************************************************
//
// The following are defines for the bit fields in the BEPROTB register
//
//*************************************************************************************************
#define SSU_BEPROTB_SECT39_22     0x10U         // Sectors 39 - 22 Bank Erase Protection
#define SSU_BEPROTB_SECT47_40     0x20U         // Sectors 47 - 40 Bank Erase Protection
#define SSU_BEPROTB_SECT55_48     0x40U         // Sectors 55 - 48 Bank Erase Protection
#define SSU_BEPROTB_SECT63_56     0x80U         // Sectors 63 - 56 Bank Erase Protection
#define SSU_BEPROTB_SECT71_64     0x100U        // Sectors 71 - 64 Bank Erase Protection
#define SSU_BEPROTB_SECT79_72     0x200U        // Sectors 79 - 72 Bank Erase Protection
#define SSU_BEPROTB_SECT87_80     0x400U        // Sectors 87 - 80 Bank Erase Protection
#define SSU_BEPROTB_SECT95_88     0x800U        // Sectors 95 - 88 Bank Erase Protection
#define SSU_BEPROTB_SECT103_96    0x1000U       // Sectors 103 - 96 Bank Erase Protection
#define SSU_BEPROTB_SECT111_104   0x2000U       // Sectors 111 - 104 Bank Erase Protection
#define SSU_BEPROTB_SECT119_112   0x4000U       // Sectors 119 - 112 Bank Erase Protection
#define SSU_BEPROTB_SECT127_120   0x8000U       // Sectors 127 - 120 Bank Erase Protection
#define SSU_BEPROTB_SECT135_128   0x10000U      // Sectors 135 - 128 Bank Erase Protection
#define SSU_BEPROTB_SECT143_136   0x20000U      // Sectors 143 - 136 Bank Erase Protection
#define SSU_BEPROTB_SECT151_144   0x40000U      // Sectors 151 - 144 Bank Erase Protection
#define SSU_BEPROTB_SECT159_152   0x80000U      // Sectors 159 - 152 Bank Erase Protection
#define SSU_BEPROTB_SECT167_160   0x100000U     // Sectors 167 - 160 Bank Erase Protection
#define SSU_BEPROTB_SECT175_168   0x200000U     // Sectors 175 - 168 Bank Erase Protection
#define SSU_BEPROTB_SECT183_176   0x400000U     // Sectors 183 - 176 Bank Erase Protection
#define SSU_BEPROTB_SECT191_184   0x800000U     // Sectors 191 - 184 Bank Erase Protection
#define SSU_BEPROTB_SECT199_192   0x1000000U    // Sectors 199 - 192 Bank Erase Protection
#define SSU_BEPROTB_SECT207_200   0x2000000U    // Sectors 207 - 200 Bank Erase Protection
#define SSU_BEPROTB_SECT215_208   0x4000000U    // Sectors 215 - 208 Bank Erase Protection
#define SSU_BEPROTB_SECT223_216   0x8000000U    // Sectors 223 - 216 Bank Erase Protection
#define SSU_BEPROTB_SECT231_224   0x10000000U   // Sectors 231 - 224 Bank Erase Protection
#define SSU_BEPROTB_SECT239_232   0x20000000U   // Sectors 239 - 232 Bank Erase Protection
#define SSU_BEPROTB_SECT247_240   0x40000000U   // Sectors 247 - 240 Bank Erase Protection
#define SSU_BEPROTB_SECT255_248   0x80000000U   // Sectors 255 - 248 Bank Erase Protection

//*************************************************************************************************
//
// The following are defines for the bit fields in the FLSEMSTAT register
//
//*************************************************************************************************
#define SSU_FLSEMSTAT_LINK_S     0U
#define SSU_FLSEMSTAT_LINK_M     0xFU          // Semaphore LINK Owner
#define SSU_FLSEMSTAT_ZONE_S     8U
#define SSU_FLSEMSTAT_ZONE_M     0x300U        // Semaphore ZONE Owner
#define SSU_FLSEMSTAT_CPU_S      12U
#define SSU_FLSEMSTAT_CPU_M      0x7000U       // Semaphore CPU Owner
#define SSU_FLSEMSTAT_MATCH      0x40000000U   // Match Status Bit
#define SSU_FLSEMSTAT_ASSIGNED   0x80000000U   // Assigned Flag

