TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_ssu.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the FLSEMREQ register
//
//*************************************************************************************************
#define SSU_FLSEMREQ_REQ   0x1U   // Request Semaphore Ownership

//*************************************************************************************************
//
// The following are defines for the bit fields in the FLSEMCLR register
//
//*************************************************************************************************
#define SSU_FLSEMCLR_CLR   0x1U   // Release Semaphore Ownership

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_CODE_BANKS register
//
//*************************************************************************************************
#define SSU_WEPROT_CODE_BANKS_PROT   0x1U   // Global Code Banks WEPROT

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_CODE_BANKS_LOCK register
//
//*************************************************************************************************
#define SSU_WEPROT_CODE_BANKS_LOCK_LOCK   0x1U   // System Access Protection Register Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_CODE_BANKS_COMMIT register
//
//*************************************************************************************************
#define SSU_WEPROT_CODE_BANKS_COMMIT_COMMIT   0x1U   // System Access Protection Register Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_DATA_BANKS register
//
//*************************************************************************************************
#define SSU_WEPROT_DATA_BANKS_PROT   0x1U   // Global Data Banks WEPROT

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_DATA_BANKS_LOCK register
//
//*************************************************************************************************
#define SSU_WEPROT_DATA_BANKS_LOCK_LOCK   0x1U   // System Access Protection Register Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_DATA_BANKS_COMMIT register
//
//*************************************************************************************************
#define SSU_WEPROT_DATA_BANKS_COMMIT_COMMIT   0x1U   // System Access Protection Register Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_FLC1_B0_A register
//
//*************************************************************************************************
#define SSU_WEPROT_FLC1_B0_A_SECT0    0x1U          // Sector 0 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT1    0x2U          // Sector 1 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT2    0x4U          // Sector 2 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT3    0x8U          // Sector 3 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT4    0x10U         // Sector 4 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT5    0x20U         // Sector 5 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT6    0x40U         // Sector 6 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT7    0x80U         // Sector 7 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT8    0x100U        // Sector 8 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT9    0x200U        // Sector 9 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT10   0x400U        // Sector 10 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT11   0x800U        // Sector 11 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT12   0x1000U       // Sector 12 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT13   0x2000U       // Sector 13 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT14   0x4000U       // Sector 14 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT15   0x8000U       // Sector 15 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT16   0x10000U      // Sector 16 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT17   0x20000U      // Sector 17 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT18   0x40000U      // Sector 18 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT19   0x80000U      // Sector 19 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT20   0x100000U     // Sector 20 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT21   0x200000U     // Sector 21 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT22   0x400000U     // Sector 22 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT23   0x800000U     // Sector 23 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT24   0x1000000U    // Sector 24 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT25   0x2000000U    // Sector 25 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT26   0x4000000U    // Sector 26 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT27   0x8000000U    // Sector 27 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT28   0x10000000U   // Sector 28 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT29   0x20000000U   // Sector 29 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT30   0x40000000U   // Sector 30 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_A_SECT31   0x80000000U   // Sector 31 Write Erase Protection

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_FLC1_B0_B register
//
//*************************************************************************************************
#define SSU_WEPROT_FLC1_B0_B_SECT39_22     0x10U         // Sectors 39 - 22 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_B_SECT47_40     0x20U         // Sectors 47 - 40 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_B_SECT55_48     0x40U         // Sectors 55 - 48 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_B_SECT63_56     0x80U         // Sectors 63 - 56 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_B_SECT71_64     0x100U        // Sectors 71 - 64 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_B_SECT79_72     0x200U        // Sectors 79 - 72 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_B_SECT87_80     0x400U        // Sectors 87 - 80 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_B_SECT95_88     0x800U        // Sectors 95 - 88 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_B_SECT103_96    0x1000U       // Sectors 103 - 96 Write Erase Protection
#define SSU_WEPROT_FLC1_B0_B_SECT111_104   0x2000U       // Sectors 111 - 104 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT119_112   0x4000U       // Sectors 119 - 112 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT127_120   0x8000U       // Sectors 127 - 120 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT135_128   0x10000U      // Sectors 135 - 128 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT143_136   0x20000U      // Sectors 143 - 136 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT151_144   0x40000U      // Sectors 151 - 144 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT159_152   0x80000U      // Sectors 159 - 152 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT167_160   0x100000U     // Sectors 167 - 160 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT175_168   0x200000U     // Sectors 175 - 168 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT183_176   0x400000U     // Sectors 183 - 176 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT191_184   0x800000U     // Sectors 191 - 184 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT199_192   0x1000000U    // Sectors 199 - 192 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT207_200   0x2000000U    // Sectors 207 - 200 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT215_208   0x4000000U    // Sectors 215 - 208 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT223_216   0x8000000U    // Sectors 223 - 216 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT231_224   0x10000000U   // Sectors 231 - 224 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT239_232   0x20000000U   // Sectors 239 - 232 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT247_240   0x40000000U   // Sectors 247 - 240 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B0_B_SECT255_248   0x80000000U   // Sectors 255 - 248 Write Erase
                                                         // Protection

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_FLC1_B0_LOCK register
//
//*************************************************************************************************
#define SSU_WEPROT_FLC1_B0_LOCK_LOCK   0x1U   // System Access Protection Register Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_FLC1_B0_COMMIT register
//
//*************************************************************************************************
#define SSU_WEPROT_FLC1_B0_COMMIT_COMMIT   0x1U   // System Access Protection Register Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_FLC1_B2_A register
//
//*************************************************************************************************
#define SSU_WEPROT_FLC1_B2_A_SECT0    0x1U          // Sector 0 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT1    0x2U          // Sector 1 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT2    0x4U          // Sector 2 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT3    0x8U          // Sector 3 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT4    0x10U         // Sector 4 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT5    0x20U         // Sector 5 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT6    0x40U         // Sector 6 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT7    0x80U         // Sector 7 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT8    0x100U        // Sector 8 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT9    0x200U        // Sector 9 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT10   0x400U        // Sector 10 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT11   0x800U        // Sector 11 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT12   0x1000U       // Sector 12 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT13   0x2000U       // Sector 13 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT14   0x4000U       // Sector 14 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT15   0x8000U       // Sector 15 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT16   0x10000U      // Sector 16 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT17   0x20000U      // Sector 17 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT18   0x40000U      // Sector 18 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT19   0x80000U      // Sector 19 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT20   0x100000U     // Sector 20 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT21   0x200000U     // Sector 21 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT22   0x400000U     // Sector 22 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT23   0x800000U     // Sector 23 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT24   0x1000000U    // Sector 24 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT25   0x2000000U    // Sector 25 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT26   0x4000000U    // Sector 26 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT27   0x8000000U    // Sector 27 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT28   0x10000000U   // Sector 28 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT29   0x20000000U   // Sector 29 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT30   0x40000000U   // Sector 30 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_A_SECT31   0x80000000U   // Sector 31 Write Erase Protection

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_FLC1_B2_B register
//
//*************************************************************************************************
#define SSU_WEPROT_FLC1_B2_B_SECT39_22     0x10U         // Sectors 39 - 22 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_B_SECT47_40     0x20U         // Sectors 47 - 40 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_B_SECT55_48     0x40U         // Sectors 55 - 48 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_B_SECT63_56     0x80U         // Sectors 63 - 56 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_B_SECT71_64     0x100U        // Sectors 71 - 64 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_B_SECT79_72     0x200U        // Sectors 79 - 72 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_B_SECT87_80     0x400U        // Sectors 87 - 80 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_B_SECT95_88     0x800U        // Sectors 95 - 88 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_B_SECT103_96    0x1000U       // Sectors 103 - 96 Write Erase Protection
#define SSU_WEPROT_FLC1_B2_B_SECT111_104   0x2000U       // Sectors 111 - 104 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT119_112   0x4000U       // Sectors 119 - 112 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT127_120   0x8000U       // Sectors 127 - 120 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT135_128   0x10000U      // Sectors 135 - 128 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT143_136   0x20000U      // Sectors 143 - 136 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT151_144   0x40000U      // Sectors 151 - 144 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT159_152   0x80000U      // Sectors 159 - 152 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT167_160   0x100000U     // Sectors 167 - 160 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT175_168   0x200000U     // Sectors 175 - 168 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT183_176   0x400000U     // Sectors 183 - 176 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT191_184   0x800000U     // Sectors 191 - 184 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT199_192   0x1000000U    // Sectors 199 - 192 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT207_200   0x2000000U    // Sectors 207 - 200 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT215_208   0x4000000U    // Sectors 215 - 208 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT223_216   0x8000000U    // Sectors 223 - 216 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT231_224   0x10000000U   // Sectors 231 - 224 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT239_232   0x20000000U   // Sectors 239 - 232 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT247_240   0x40000000U   // Sectors 247 - 240 Write Erase
                                                         // Protection
#define SSU_WEPROT_FLC1_B2_B_SECT255_248   0x80000000U   // Sectors 255 - 248 Write Erase
                                                         // Protection

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_FLC1_B2_LOCK register
//
//*************************************************************************************************
#define SSU_WEPROT_FLC1_B2_LOCK_LOCK   0x1U   // System Access Protection Register Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_FLC1_B2_COMMIT register
//
//*************************************************************************************************
#define SSU_WEPROT_FLC1_B2_COMMIT_COMMIT   0x1U   // System Access Protection Register Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the WEPROT_FLC2_B0_A register
//
//*************************************************************************************************
#define SSU_WEPROT_FLC2_B0_A_SECT0    0x1U          // Sector 0 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT1    0x2U          // Sector 1 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT2    0x4U          // Sector 2 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT3    0x8U          // Sector 3 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT4    0x10U         // Sector 4 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT5    0x20U         // Sector 5 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT6    0x40U         // Sector 6 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT7    0x80U         // Sector 7 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT8    0x100U        // Sector 8 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT9    0x200U        // Sector 9 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT10   0x400U        // Sector 10 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT11   0x800U        // Sector 11 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT12   0x1000U       // Sector 12 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT13   0x2000U       // Sector 13 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT14   0x4000U       // Sector 14 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT15   0x8000U       // Sector 15 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT16   0x10000U      // Sector 16 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT17   0x20000U      // Sector 17 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT18   0x40000U      // Sector 18 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT19   0x80000U      // Sector 19 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT20   0x100000U     // Sector 20 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT21   0x200000U     // Sector 21 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT22   0x400000U     // Sector 22 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT23   0x800000U     // Sector 23 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT24   0x1000000U    // Sector 24 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT25   0x2000000U    // Sector 25 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT26   0x4000000U    // Sector 26 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT27   0x8000000U    // Sector 27 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT28   0x10000000U   // Sector 28 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT29   0x20000000U   // Sector 29 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT30   0x40000000U   // Sector 30 Write Erase Protection
#define SSU_WEPROT_FLC2_B0_A_SECT31   0x80000000U   // Sector 31 Write Erase Protection

