TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_ssu.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the DECODER_ADDR_IN register
//
//*************************************************************************************************
#define SSU_DECODER_ADDR_IN_ADDR_L_S   12U
#define SSU_DECODER_ADDR_IN_ADDR_L_M   0xF000U       // Address Bits 15:12
#define SSU_DECODER_ADDR_IN_ADDR_H_S   16U
#define SSU_DECODER_ADDR_IN_ADDR_H_M   0xFFFF0000U   // Address Bits 31:16

//*************************************************************************************************
//
// The following are defines for the bit fields in the DECODER_OUT register
//
//*************************************************************************************************
#define SSU_DECODER_OUT_LINK_S    0U
#define SSU_DECODER_OUT_LINK_M    0xFU          // Decoded LINK
#define SSU_DECODER_OUT_STACK_S   4U
#define SSU_DECODER_OUT_STACK_M   0x70U         // Decoded STACK
#define SSU_DECODER_OUT_ZONE_S    8U
#define SSU_DECODER_OUT_ZONE_M    0x300U        // Decoded ZONE
#define SSU_DECODER_OUT_APR_S     16U
#define SSU_DECODER_OUT_APR_M     0x7F0000U     // Access Protection Region
#define SSU_DECODER_OUT_INVALID   0x80000000U   // Decoder Output Invalid

//*************************************************************************************************
//
// The following are defines for the bit fields in the EMU_DECODER_ADDR_IN register
//
//*************************************************************************************************
#define SSU_EMU_DECODER_ADDR_IN_ADDR_L_S   12U
#define SSU_EMU_DECODER_ADDR_IN_ADDR_L_M   0xF000U       // Address Bits 15:12
#define SSU_EMU_DECODER_ADDR_IN_ADDR_H_S   16U
#define SSU_EMU_DECODER_ADDR_IN_ADDR_H_M   0xFFFF0000U   // Address Bits 31:16

//*************************************************************************************************
//
// The following are defines for the bit fields in the EMU_DECODER_OUT register
//
//*************************************************************************************************
#define SSU_EMU_DECODER_OUT_LINK_S    0U
#define SSU_EMU_DECODER_OUT_LINK_M    0xFU          // Decoded LINK
#define SSU_EMU_DECODER_OUT_STACK_S   4U
#define SSU_EMU_DECODER_OUT_STACK_M   0x70U         // Decoded STACK
#define SSU_EMU_DECODER_OUT_ZONE_S    8U
#define SSU_EMU_DECODER_OUT_ZONE_M    0x300U        // Decoded ZONE
#define SSU_EMU_DECODER_OUT_APR_S     16U
#define SSU_EMU_DECODER_OUT_APR_M     0x7F0000U     // Access Protection Region
#define SSU_EMU_DECODER_OUT_INVALID   0x80000000U   // Decoder Output Invalid


//*************************************************************************************************
//
// The following are defines for the bit fields in the AP_START_EXT register
//
//*************************************************************************************************
#define SSU_AP_START_EXT_ADDRL_S   12U
#define SSU_AP_START_EXT_ADDRL_M   0xF000U       // Lower End Address
#define SSU_AP_START_EXT_ADDRH_S   16U
#define SSU_AP_START_EXT_ADDRH_M   0xFFFF0000U   // Upper End Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the AP_END_EXT register
//
//*************************************************************************************************
#define SSU_AP_END_EXT_ADDRL_S   12U
#define SSU_AP_END_EXT_ADDRL_M   0xF000U       // Lower End Address
#define SSU_AP_END_EXT_ADDRH_S   16U
#define SSU_AP_END_EXT_ADDRH_M   0xFFFF0000U   // Upper End Address


//*************************************************************************************************
//
// The following are defines for the bit fields in the AP_CFG register
//
//*************************************************************************************************
#define SSU_AP_CFG_LINKID_S    0U
#define SSU_AP_CFG_LINKID_M    0xFU      // LINK ID Value
#define SSU_AP_CFG_APD         0x40U     // Access Protection Disable
#define SSU_AP_CFG_XE          0x80U     // Execute Enable
#define SSU_AP_CFG_APILINK_S   8U
#define SSU_AP_CFG_APILINK_M   0xF00U    // Access Protection Inheritance LINK
#define SSU_AP_CFG_APILINKE    0x4000U   // Access Protection Inheritance LINK Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the AP_START register
//
//*************************************************************************************************
#define SSU_AP_START_ADDRL_S     12U
#define SSU_AP_START_ADDRL_M     0xF000U       // Lower Start Address
#define SSU_AP_START_ADDRH_S     16U
#define SSU_AP_START_ADDRH_M     0xFF0000U     // Upper Start Address
#define SSU_AP_START_MEMTYPE_S   28U
#define SSU_AP_START_MEMTYPE_M   0x70000000U   // Start Address Memory Type

//*************************************************************************************************
//
// The following are defines for the bit fields in the AP_END register
//
//*************************************************************************************************
#define SSU_AP_END_ADDRL_S     12U
#define SSU_AP_END_ADDRL_M     0xF000U       // Lower End Address
#define SSU_AP_END_ADDRH_S     16U
#define SSU_AP_END_ADDRH_M     0xFF0000U     // Upper End Address
#define SSU_AP_END_MEMTYPE_S   28U
#define SSU_AP_END_MEMTYPE_M   0x70000000U   // Start Address Memory Type

//*************************************************************************************************
//
// The following are defines for the bit fields in the AP_LOCK register
//
//*************************************************************************************************
#define SSU_AP_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the AP_COMMIT register
//
//*************************************************************************************************
#define SSU_AP_COMMIT_COMMIT   0x1U   // Permanent Commit

//*************************************************************************************************
//
// The following are defines for the bit fields in the AP_ACCESS register
//
//*************************************************************************************************
#define SSU_AP_ACCESS_LINK0_S    0U
#define SSU_AP_ACCESS_LINK0_M    0x3U          // LINK0 Access Permissions
#define SSU_AP_ACCESS_LINK1_S    2U
#define SSU_AP_ACCESS_LINK1_M    0xCU          // LINK1 Access Permissions
#define SSU_AP_ACCESS_LINK2_S    4U
#define SSU_AP_ACCESS_LINK2_M    0x30U         // LINK2 Access Permissions
#define SSU_AP_ACCESS_LINK3_S    6U
#define SSU_AP_ACCESS_LINK3_M    0xC0U         // LINK3 Access Permissions
#define SSU_AP_ACCESS_LINK4_S    8U
#define SSU_AP_ACCESS_LINK4_M    0x300U        // LINK4 Access Permissions
#define SSU_AP_ACCESS_LINK5_S    10U
#define SSU_AP_ACCESS_LINK5_M    0xC00U        // LINK5 Access Permissions
#define SSU_AP_ACCESS_LINK6_S    12U
#define SSU_AP_ACCESS_LINK6_M    0x3000U       // LINK6 Access Permissions
#define SSU_AP_ACCESS_LINK7_S    14U
#define SSU_AP_ACCESS_LINK7_M    0xC000U       // LINK7 Access Permissions
#define SSU_AP_ACCESS_LINK8_S    16U
#define SSU_AP_ACCESS_LINK8_M    0x30000U      // LINK8 Access Permissions
#define SSU_AP_ACCESS_LINK9_S    18U
#define SSU_AP_ACCESS_LINK9_M    0xC0000U      // LINK9 Access Permissions
#define SSU_AP_ACCESS_LINK10_S   20U
#define SSU_AP_ACCESS_LINK10_M   0x300000U     // LINK10 Access Permissions
#define SSU_AP_ACCESS_LINK11_S   22U
#define SSU_AP_ACCESS_LINK11_M   0xC00000U     // LINK11 Access Permissions
#define SSU_AP_ACCESS_LINK12_S   24U
#define SSU_AP_ACCESS_LINK12_M   0x3000000U    // LINK12 Access Permissions
#define SSU_AP_ACCESS_LINK13_S   26U
#define SSU_AP_ACCESS_LINK13_M   0xC000000U    // LINK13 Access Permissions
#define SSU_AP_ACCESS_LINK14_S   28U
#define SSU_AP_ACCESS_LINK14_M   0x30000000U   // LINK14 Access Permissions
#define SSU_AP_ACCESS_LINK15_S   30U
#define SSU_AP_ACCESS_LINK15_M   0xC0000000U   // LINK15 Access Permissions

//*************************************************************************************************
//
// The following are defines for the bit fields in the AP_START register
//
//*************************************************************************************************
#define SSU_AP_START_ADDRL_S     12U
#define SSU_AP_START_ADDRL_M     0xF000U       // Lower Start Address
#define SSU_AP_START_ADDRH_S     16U
#define SSU_AP_START_ADDRH_M     0xFF0000U     // Upper Start Address
#define SSU_AP_START_MEMTYPE_S   28U
#define SSU_AP_START_MEMTYPE_M   0x70000000U   // Start Address Memory Type

//*************************************************************************************************
//
// The following are defines for the bit fields in the AP_END register
//
//*************************************************************************************************
#define SSU_AP_END_ADDRL_S     12U
#define SSU_AP_END_ADDRL_M     0xF000U       // Lower End Address
#define SSU_AP_END_ADDRH_S     16U
#define SSU_AP_END_ADDRH_M     0xFF0000U     // Upper End Address
#define SSU_AP_END_MEMTYPE_S   28U
#define SSU_AP_END_MEMTYPE_M   0x70000000U   // Start Address Memory Type



#endif
